macos2/STC90C516RD/stc16f_keil.h
#define PWMB_CR1            (*(unsigned char volatile far *)0x7efee0)
#define PWMB_CR2            (*(unsigned char volatile far *)0x7efee1)
#define PWMB_SMCR           (*(unsigned char volatile far *)0x7efee2)
#define PWMB_ETR            (*(unsigned char volatile far *)0x7efee3)
#define PWMB_IER            (*(unsigned char volatile far *)0x7efee4)
#define PWMB_SR1            (*(unsigned char volatile far *)0x7efee5)
#define PWMB_SR2            (*(unsigned char volatile far *)0x7efee6)
#define PWMB_EGR            (*(unsigned char volatile far *)0x7efee7)
#define PWMB_CCMR1          (*(unsigned char volatile far *)0x7efee8)
#define PWMB_CCMR2          (*(unsigned char volatile far *)0x7efee9)
#define PWMB_CCMR3          (*(unsigned char volatile far *)0x7efeea)
#define PWMB_CCMR4          (*(unsigned char volatile far *)0x7efeeb)
#define PWMB_CCER1          (*(unsigned char volatile far *)0x7efeec)
#define PWMB_CCER2          (*(unsigned char volatile far *)0x7efeed)
#define PWMB_CNTRH          (*(unsigned char volatile far *)0x7efeee)
#define PWMB_CNTRL          (*(unsigned char volatile far *)0x7efeef)
#define PWMB_PSCRH          (*(unsigned char volatile far *)0x7efef0)
#define PWMB_PSCRL          (*(unsigned char volatile far *)0x7efef1)
#define PWMB_ARRH           (*(unsigned char volatile far *)0x7efef2)
#define PWMB_ARRL           (*(unsigned char volatile far *)0x7efef3)
#define PWMB_RCR            (*(unsigned char volatile far *)0x7efef4)
#define PWMB_CCR1H          (*(unsigned char volatile far *)0x7efef5)
#define PWMB_CCR1L          (*(unsigned char volatile far *)0x7efef6)
#define PWMB_CCR2H          (*(unsigned char volatile far *)0x7efef7)
#define PWMB_CCR2L          (*(unsigned char volatile far *)0x7efef8)
#define PWMB_CCR3H          (*(unsigned char volatile far *)0x7efef9)
#define PWMB_CCR3L          (*(unsigned char volatile far *)0x7efefa)
#define PWMB_CCR4H          (*(unsigned char volatile far *)0x7efefb)
#define PWMB_CCR4L          (*(unsigned char volatile far *)0x7efefc)
#define PWMB_BKR            (*(unsigned char volatile far *)0x7efefd)
#define PWMB_DTR            (*(unsigned char volatile far *)0x7efefe)
#define PWMB_OISR           (*(unsigned char volatile far *)0x7efeff)

/////////////////////////////////////////////////
//7E:FD00H-7E:FDFFH
/////////////////////////////////////////////////



/////////////////////////////////////////////////
//7E:FC00H-7E:FCFFH
/////////////////////////////////////////////////



/////////////////////////////////////////////////
//7E:FB00H-7E:FBFFH
/////////////////////////////////////////////////



/////////////////////////////////////////////////
//7E:FA00H-7E:FAFFH
/////////////////////////////////////////////////


/////////////////////////////////////////////////

#define INT0_VECTOR         0       //0003H
#define TMR0_VECTOR         1       //000BH
#define INT1_VECTOR         2       //0013H
#define TMR1_VECTOR         3       //001BH
#define UART1_VECTOR        4       //0023H
#define ADC_VECTOR          5       //002BH
#define LVD_VECTOR          6       //0033H
#define PWM1_VECTOR         7       //003BH
#define UART2_VECTOR        8       //0043H
#define SPI_VECTOR          9       //004BH
#define INT2_VECTOR         10      //0053H
#define INT3_VECTOR         11      //005BH
#define TMR2_VECTOR         12      //0063H
#define USER_VECTOR         13      //006BH
#define INT4_VECTOR         16      //0083H
#define UART3_VECTOR        17      //008BH
#define UART4_VECTOR        18      //0093H
#define TMR3_VECTOR         19      //009BH
#define TMR4_VECTOR         20      //00A3H
#define CMP_VECTOR          21      //00ABH
#define USB_VECTOR          22      //00B3H
#define PWM2_VECTOR         23      //00BBH
#define I2C_VECTOR          24      //00C3H
#define CAN_VECTOR          28      //00E3H
#define LIN_VECTOR          29      //00EBH

/////////////////////////////////////////////////

#endif

